# First step in eda 
## Catorgorize cols
### - Numerical,Catgorical,mix type
### Numerical age,fare,passenger id

## Step 2:
    - perform univariate analysis
         Distribution analysis. 
    - Bi variate analysis
    - Multivariate analysis
    - Feature engineering 
    - Outlier detection

In [3]:
import pandas as pd
import seaborn as sns

In [7]:
data=sns.load_dataset('titanic')

In [9]:
data.sample(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
848,0,2,male,28.0,0,1,33.0000,S,Second,man,True,NaN,Southampton,no,False
806,0,1,male,39.0,0,0,0.0000,S,First,man,True,A,Southampton,no,True
192,1,3,female,19.0,1,0,7.8542,S,Third,woman,False,NaN,Southampton,yes,False
661,0,3,male,40.0,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
663,0,3,male,36.0,0,0,7.4958,S,Third,man,True,NaN,Southampton,no,True

In [13]:
### First we can do univariate analysis
data['age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64